docs/lambda.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-13 Thu 11:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The lambda calculus</title>
<meta name="author" content="Patrick D. Elliott" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">The lambda calculus
<br />
<span class="subtitle">Prolegomenon to functional programming</span>
</h1>

<div id="outline-container-org1591325" class="outline-2">
<h2 id="org1591325"><span class="section-number-2">1.</span> The plan</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><b>Today:</b> theoretical preliminaries to programming in haskell - functions and the (simple, untyped) lambda calculus.</li>
<li><b>Week 2:</b>
<ul class="org-ul">
<li>Setting up a haskell dev environment.</li>
<li>Getting started with haskell - basic concepts and syntax.</li>
</ul></li>
<li><b>Week 3:</b> strings and lists.</li>
<li><b>Week 4:</b> datatypes, typeclasses, etc.</li>
<li>In subsequent weeks, once we have a grasp of functional programming basics, we'll start to tackle linguistics-specific topics, using (van Eijck, Jan and Unger, Christina, 2010).</li>
</ul>
</div>
</div>

<div id="outline-container-org3575781" class="outline-2">
<h2 id="org3575781"><span class="section-number-2">2.</span> Why study the lambda calculus</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>The lambda calculus is a formal logic for reasoning about computation; the simple untyped lambda calculus is Turing complete, and can therefore be used to reason about <i>any</i> computation.</li>
<li>Haskell is based on a more restrictive, but still extremely expressive variant of the lambda calculus called <b>System F</b> (i.e., the polymorphic lambda calculus).</li>
<li>Moreover, the lambda calculus undergirds the functional programming paradigm more generally (see, e.g., one of the many variants of <i>lisp</i>).</li>
<li>The lambda calculus is a common formal tool in theoretical linguistics; more specifically, it is a <i>lingua franca</i> in compositional semantics.</li>
</ul>
</div>
</div>

<div id="outline-container-org1479fb1" class="outline-2">
<h2 id="org1479fb1"><span class="section-number-2">3.</span> Semantic computation as a program</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>If you've taken a formal semantics class before, the following might look familiar:</li>
</ul>
</div>
</div>

<div id="outline-container-org508b8f2" class="outline-2">
<h2 id="org508b8f2"><span class="section-number-2">4.</span> Embedding a semantic fragment in haskell</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cba6f7;">data</span> <span style="color: #b4befe;">E</span> <span style="color: #89dceb;">=</span> <span style="color: #cba6f7;">Chomsky</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">Reinhart</span> <span style="color: #89dceb;">|</span> <span style="color: #cba6f7;">Borer</span> <span style="color: #89dceb;">|</span> <span style="color: #89dceb;">...</span>

<span style="color: #89b4fa;">_people</span> <span style="color: #89dceb;">::</span> [<span style="color: #b4befe;">E</span>]
<span style="color: #89b4fa;">_people</span> <span style="color: #89dceb;">=</span> [<span style="color: #cba6f7;">Chomsky</span>,<span style="color: #cba6f7;">Reinhart</span>,<span style="color: #cba6f7;">Borer</span>,<span style="color: #89dceb;">...</span>]

<span style="color: #89b4fa;">_reads</span> <span style="color: #89dceb;">::</span> <span style="color: #b4befe;">E</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #b4befe;">E</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #b4befe;">Bool</span>

<span style="color: #89b4fa;">_everyone</span> <span style="color: #89dceb;">::</span> (<span style="color: #b4befe;">E</span> <span style="color: #89dceb;">-&gt;</span> <span style="color: #b4befe;">Bool</span>) <span style="color: #89dceb;">-&gt;</span> <span style="color: #b4befe;">Bool</span>
<span style="color: #89b4fa;">_everyone</span> f <span style="color: #89dceb;">=</span> all f _people

<span style="color: #585b70;">-- </span><span style="color: #585b70;">&gt;&gt;&gt; (_everyone (_reads Chomsky)) :: Bool</span>
<span style="color: #585b70;">-- </span><span style="color: #585b70;">&gt;&gt;&gt; ((_reads Chomsky) _Borer) :: Bool</span>
<span style="color: #585b70;">-- </span><span style="color: #585b70;">&gt;&gt;&gt; (everyone (\x -&gt; (_reads x Borer))) :: Bool</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf997df" class="outline-2">
<h2 id="orgcf997df"><span class="section-number-2">5.</span> Functions</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>A function is a special kind of relation between <i>inputs</i> and <i>outputs</i>.</li>
<li>For example, we might imaging a function \(f\) that defines the following relations:
<ul class="org-ul">
<li>\(f(1) = A\)</li>
<li>\(f(2) = B\)</li>
<li>\(f(3) = C\)</li>
</ul></li>
<li>The input set is \(\{1,2,3\}\)</li>
<li>and the output set is \(\{A,B,C\}\).</li>
</ul>
</div>
</div>

<div id="outline-container-orgc231160" class="outline-2">
<h2 id="orgc231160"><span class="section-number-2">6.</span> Determinacy</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Is \(f\) in the following a valid function?
<ul class="org-ul">
<li>\(f(1) = A\)</li>
<li>\(f(1) = B\)</li>
<li>\(f(2) = C\)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge5c02a6" class="outline-2">
<h2 id="orge5c02a6"><span class="section-number-2">7.</span> Uniqueness</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Is \(f\) in the following a valid function?
<ul class="org-ul">
<li>\(f(1) = A\)</li>
<li>\(f(2) = A\)</li>
<li>\(f(3) = B\)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd785ead" class="outline-2">
<h2 id="orgd785ead"><span class="section-number-2">8.</span> Function terminology</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>We call the set of values from which a function draws its inputs the <b>domain</b> of the function.</li>
<li>We call the set of values from which a function draws its outputs the <b>codomain</b>.</li>
<li>A function always maps <i>every</i> member of the domain to a member of the codomain, but not every member of the codomain is necessarily paired with an input. We call the subset of values in the codomain paired with inputs the <b>image</b> of the function.</li>
</ul>
</div>
</div>

<div id="outline-container-org87dfc7c" class="outline-2">
<h2 id="org87dfc7c"><span class="section-number-2">9.</span> Functions as relations</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>Functions can be represented as <i>relations</i>, i.e., sets of ordered pairs.</li>
<li>For example, the following is a valid function:
<ul class="org-ul">
<li>\(\{(1,A),(2,B),(3,C)\}\)</li>
</ul></li>
<li>A relation \(R\) is <i>functional</i> iff \(\forall (x,y),(x',y'), x = x' \rightarrow y = y')\).</li>
<li>Which of the following relations are functional?
<ul class="org-ul">
<li>\(\{(\text{Chomsky},\text{SynStr}),(\text{Reinhart},\text{Int}),(\text{Chomsky},\text{Asp})\}\)</li>
<li>\(\{(\text{Ross} ,\text{Chomsky}),(\text{Pesetsky} ,\text{Chomsky} ),(\text{Nevins} ,\text{Halle} )\}\)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org452eef7" class="outline-2">
<h2 id="org452eef7"><span class="section-number-2">10.</span> Extension vs. intension</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>The intuition behind functions is that they define <b>determinate</b> <i>procedures</i> for getting from an input to a fixed output.</li>
<li>Sometimes we can simply list the input-output pairings defined by the function (this is called the function's <i>extension</i>).</li>
<li>Most of the time this either isn't useful or it's impossible, rather we describe the procedure - this is called giving the function's <i>intension</i>. One famous function is the <i>successor function</i>.
<ul class="org-ul">
<li>\(f(x) = x + 1\)</li>
</ul></li>
<li>We could try giving the extension:
<ul class="org-ul">
<li>\(\{(0,1),(1,2),(2,3),(4,5),\ldots\}\)</li>
</ul></li>
<li>Given that the domain and codomain are infinite,  this is practically impossible.</li>
</ul>
</div>
</div>

<div id="outline-container-org6731266" class="outline-2">
<h2 id="org6731266"><span class="section-number-2">11.</span> Lambda expressions</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>The lambda calculus is used as a logic used to reason about functions, how they compose, and computation more generally.</li>
<li>Valid <b>expressions</b> of the lambda calculus can be variables, abstraction, or combinations of both; variables have no intrinsic meaning, they're just names for possible inputs to functions.</li>
</ul>
</div>
</div>
