handouts/lambda.org
* Structure of an abstraction

- *Abstractions* are made up of two parts: a /head/ and a /body/.
  * \(\overbrace{\lambda x}^{\text{head} } . \underbrace{\alpha}_{\text{body} } \)
- The head is the \(\lambda\) symbol followed by a variable name. Variables in the body matching the variable name are /bound/.
- The body is a valid expression of the lambda calculus which follows the dot. 
- Abstractions in the lambda calculus are interpreted as functions; the head of the abstraction stands in for the input to the function, and the body of the abstraction tells us how we arrive at the output.
- Lambda abstractions allow us to describe what functions do without naming them; we'll sometimes call lambda abstractions /anonymous functions/.
  
* Structure of an abstraction ii

- *Question:* what kind of function is the following abstraction? What does it do?
  * \(\lambda x\,.\,x\)

* \(\alpha \)-conversion 

- So, abstractions are used to express functions. The choice of variable name used in the head is arbitrary - this gives rise to an intuitive notion of sameness: *alpha equivalence*. 
- The following expressions are all /alpha equivalent/ (that is, they all express the same function):
  * \(\lambda x . x\) 
  * \(\lambda d . d\)
  * \(\lambda z . z\)
- The procedure of substituting some expression for an \(\alpha \)-equivalent variant is known as *alpha conversion*.

* \(\beta \)-reduction

- Beta reduction corresponds to applying a function to an argument, in the lambda calculus.
- A /functional application/ is written as \(f(x)\) where \(f\) is the function, and \(x\) is the argument. In anticipation of haskell syntactic conventions, we'll often indicate function application with a space, i.e., \(f\,x\)
- Beta reduction involves deleting the head, and substituting all occurrences of the bound variable in the body with the function's argument.
  * \((\lambda x . x + 1)\,2\)
- *Question:* What is the result of beta reduction?

* \(\eta\)-reduction

- A named function can always be expressed as an anonymous function by applying it to a variable \(x\), and then /abstracting/ over that variable with a \(\lambda x\).
- This gives rise to a notion of /eta equivalence/. The following functions are eta equivalent:
  * \(f\)
  * \(\lambda x . f(x)\)
- Simplifying some expression with some eta-equivalent variable is called /eta conversion/; the special case of simplification is called /eta reduction/.

* More reductions

- Nothing stops us from applying a /function/ to another /function/:
  * \((\lambda x . x)(\lambda y . y)\)
  * \([x := (\lambda y . y)]\)
  * \(\lambda y . y\)
- Note that \([x := \alpha]\) indicates that the variable \(x\) is substituted with the expression \(\alpha \) in the function body.

* Associativity

- Functional application is /left associative/:
  * \((\lambda x. x) (\lambda y . y) z := ((\lambda x . x) (\lambda y . y)) z\)

* Normal form

- The previous expression involved a functional application nested within a functional application:
  * \(((\lambda x . x) (\lambda y . y)) z\)
- We typically reduce from the inside out:
  * \([x := (\lambda y . y)]\)
  * \((\lambda y . y) z\)
  * \([y := z]\)
  * \(z\)
- If no further reductions are possible, we say that the expression is in *normal form*.
  * Reduction is essentially how the lambda calculus models computation.

* Free variables

- Sometimes, the body of an abstraction contains variables which aren't bound by the head - these variables are /free/ (within the abstraction):
  * \(\lambda x . xy\) 
- Let's try applying an abstraction with free variables to an argument:
  * \((\lambda x . xy) z\)
  * \([x := z]\)
  * \(zy\)
- Note that alpha equivalence doesn't apply to free variables: \(\lambda x . xy\) and \(\lambda x . xz\) are different expressions, because \(y\) and \(z\) might be assigned distinct values.

* Multiple arguments

- Each \(\lambda \) can only bind one parameter and can only accept one argument.
- Multiple arguments are encoded by multiple \(\lambda \)s (this is called /currying/; semanticists call it /Schönfinkelization/).
  * \(\lambda xy.xy := \lambda x . (\lambda y . x y)\)
- N.b. in haskell we'll be able to express functions that take tuples of arguments by using something called /pattern matching/.

* Reduction with multiple arguments 1

1. \(\lambda xy . xy\)
2. \((\lambda xy . xy)\,1\,2\)
3. \((\lambda x . (\lambda y . xy))\,1\,2\)
4. \([x := 1]\)
5. \((\lambda y . 1\,y)\, 2\)
6. \([y := 2]\)
7. \(1\,2\)
   
We've reached normal form, since we can't apply \(1\) to \(2\).
   
* Reduction with multiple arguments 2

1. \((\lambda xy . xy)\,(\lambda z. a)\,1\)
2. \((\lambda x . (\lambda y. xy))\,(\lambda z . a)\,1\)
3. \([x := (\lambda z . a)]\)
4. \((\lambda y.(\lambda z. a)\,y)\, 1\)
5. \([y := 1]\)
6. \((\lambda z . a)\,1\)
7. \([z := 1]\)
8. \(a\)
   
* Proof-theory

- Simplification rules for the lambda calculus:
  * \(\beta \)-reduction
  * \(\alpha \)-conversion
  * \(\eta\)-reduction
    
- The lambda calculus can be thought of as a /logic/, and these rules constitute its proof theory.
- We've left the (denotational) semantics of the lambda calculus implicit, but intuitively \(\beta \)-reduction is licit /because/ applications are interpreted by applying the function to the argument, etc.
- The variant of the lambda calculus we're considering here is /Turing complete/, which means that it can be used to simulate an arbitrary Turing machine.
  
* More alpha conversions

- How do we go about reducing this expression?
  * \((\lambda xy . x x y)\,(\lambda x . xy)\,(\lambda x . xz)\)

* Evaluation and simplification

- Remember, when we can no longer simplify an expression, the result is said to be in *normal form* (N.b., there are different kinds of normal forms, but the differences aren't relevant to us).
- In programming terms, this corresponds to a *fully executed program*.
- Artithmetic expressions can be thought of as a simple logic/programming language.
  * \((10 + 2) * 100 / 2\)
- What's the normal form of this arithmetic expression?
- Remember that complex expressions can nevertheless be in normal form, such as \(\lambda x . x\).
  
