docs/lambda.html

<div id="outline-container-org343f630" class="outline-2">
<h2 id="org343f630"><span class="section-number-2">12.</span> Structure of an abstraction</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li><b>Abstractions</b> are made up of two parts: a <i>head</i> and a <i>body</i>.
<ul class="org-ul">
<li>\(\lambda x . x\)</li>
</ul></li>
<li>The head is the \(\lambda\) symbol followed by a variable name. Variables in the body matching the variable name are <i>bound</i>.</li>
<li>The body is a valid expression of the lambda calculus which follows the dot.</li>
<li>Abstractions in the lambda calculus are interpreted as functions; the head of the abstraction stands in for the input to the function, and the body of the abstraction tells us how we arrive at the output.</li>
<li>Lambda abstractions allow us to describe what functions do without naming them; we'll sometimes call lambda abstractions <i>anonymous functions</i>.</li>
<li><b>Question:</b> what kind of function is the abstraction above? What does it do?</li>
</ul>
</div>
</div>

<div id="outline-container-org70b6df2" class="outline-2">
<h2 id="org70b6df2"><span class="section-number-2">13.</span> \(\alpha \)-conversion</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>So, abstractions are used to express functions. The choice of variable name used in the head is arbitrary - this gives rise to an intuitive notion of sameness: <b>alpha equivalence</b>.</li>
<li>The following expressions are all <i>alpha equivalent</i> (that is, they all express the same function):
<ul class="org-ul">
<li>\(\lambda x . x\)</li>
<li>\(\lambda d . d\)</li>
<li>\(\lambda z . z\)</li>
</ul></li>
<li>The procedure of substituting some expression for an \(\alpha \)-equivalent variant is known as <b>alpha conversion</b>.</li>
</ul>
</div>
</div>

<div id="outline-container-org8a0349b" class="outline-2">
<h2 id="org8a0349b"><span class="section-number-2">14.</span> \(\beta \)-reduction</h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li>Beta reduction corresponds to applying a function to an argument, in the lambda calculus.</li>
<li>A <i>functional application</i> is written as \(f(x)\) where \(f\) is the function, and \(x\) is the argument. In anticipation of haskell syntactic conventions, we'll often indicate function application with a space, i.e., \(f\,x\)</li>
<li>Beta reduction involves deleting the head, and substituting all occurrences of the bound variable in the body with the function's argument.
<ul class="org-ul">
<li>\((\lambda x . x + 1)\,2\)</li>
</ul></li>
<li><b>Question:</b> What is the result of beta reduction?</li>
</ul>
</div>
</div>

<div id="outline-container-orgc5d8273" class="outline-2">
<h2 id="orgc5d8273"><span class="section-number-2">15.</span> \(\eta\)-reduction</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li>A named function can always be expressed as an anonymous function by applying it to a variable \(x\), and then <i>abstracting</i> over that variable with a \(\lambda x\).</li>
<li>This gives rise to a notion of <i>eta equivalence</i>. The following functions are eta equivalent:
<ul class="org-ul">
<li>\(f\)</li>
<li>\(\lambda x . f(x)\)</li>
</ul></li>
<li>Simplifying some expression with some eta-equivalent variable is called <i>eta conversion</i>; the special case of simplification is called <i>eta reduction</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-org1f865b9" class="outline-2">
<h2 id="org1f865b9"><span class="section-number-2">16.</span> More reductions</h2>
<div class="outline-text-2" id="text-16">
<ul class="org-ul">
<li>Nothing stops us from applying a <i>function</i> to another <i>function</i>:
<ul class="org-ul">
<li>\((\lambda x . x)(\lambda y . y)\)</li>
<li>\([x := (\lambda y . y)]\)</li>
<li>\(\lambda y . y\)</li>
</ul></li>
<li>Note that \([x := \alpha]\) indicates that the variable \(x\) is substituted with the expression \(\alpha \) in the function body.</li>
</ul>
</div>
</div>

<div id="outline-container-orga244ae8" class="outline-2">
<h2 id="orga244ae8"><span class="section-number-2">17.</span> Associativity</h2>
<div class="outline-text-2" id="text-17">
<ul class="org-ul">
<li>Functional application is <i>left associative</i>:
<ul class="org-ul">
<li>\((\lambda x. x) (\lambda y . y) z := ((\lambda x . x) (\lambda y . y)) z\)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9a15fab" class="outline-2">
<h2 id="org9a15fab"><span class="section-number-2">18.</span> Normal form</h2>
<div class="outline-text-2" id="text-18">
<ul class="org-ul">
<li>The previous expression involved a functional application nested within a functional application:
<ul class="org-ul">
<li>\(((\lambda x . x) (\lambda y . y)) z\)</li>
</ul></li>
<li>We typically reduce from the inside out:
<ul class="org-ul">
<li>\([x := (\lambda y . y)]\)</li>
<li>\((\lambda y . y) z\)</li>
<li>\([y := z]\)</li>
<li>\(z\)</li>
</ul></li>
<li>If no further reductions are possible, we say that the expression is in <b>normal form</b>.</li>
</ul>
</div>
</div>

<div id="outline-container-org36c7fe2" class="outline-2">
<h2 id="org36c7fe2"><span class="section-number-2">19.</span> Free variables</h2>
<div class="outline-text-2" id="text-19">
<ul class="org-ul">
<li>Sometimes, the body of an abstraction contains variables which aren't bound by the head - these variables are <i>free</i> (within the abstraction):
<ul class="org-ul">
<li>\(\lambda x . xy\)</li>
</ul></li>
<li>Let's try applying an abstraction with free variables to an argument:
<ul class="org-ul">
<li>\((\lambda x . xy) z\)</li>
<li>\([x := z]\)</li>
<li>\(zy\)</li>
</ul></li>
<li>Note that alpha equivalence doesn't apply to free variables: \(\lambda x . xy\) and \(\lambda x . xz\) are different expressions, because \(y\) and \(z\) might be assigned distinct values.</li>
</ul>
</div>
</div>

<div id="outline-container-org646e791" class="outline-2">
<h2 id="org646e791"><span class="section-number-2">20.</span> Multiple arguments</h2>
<div class="outline-text-2" id="text-20">
<ul class="org-ul">
<li>Each \(\lambda \) can only bind one parameter and can only accept one argument.</li>
<li>Multiple arguments are encoded by multiple \(\lambda \)s (this is called <i>currying</i>; semanticists call it <i>Schönfinkelization</i>).
<ul class="org-ul">
<li>\(\lambda xy.xy := \lambda x . (\lambda y . x y)\)</li>
</ul></li>
<li>N.b. in haskell we'll be able to express functions that take tuples of arguments by using something called <i>pattern matching</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc069f3d" class="outline-2">
<h2 id="orgc069f3d"><span class="section-number-2">21.</span> Reduction with multiple arguments 1</h2>
<div class="outline-text-2" id="text-21">
<ol class="org-ol">
<li>\(\lambda xy . xy\)</li>
<li>\((\lambda xy . xy)\,1\,2\)</li>
<li>\((\lambda x . (\lambda y . xy))\,1\,2\)</li>
<li>\([x := 1]\)</li>
<li>\((\lambda y . 1\,y)\, 2\)</li>
<li>\([y := 2]\)</li>
<li>\(1\,2\)</li>
</ol>

<p>
We've reached normal form, since we can't apply \(1\) to \(2\).
</p>
</div>
</div>

<div id="outline-container-org43c0dc6" class="outline-2">
<h2 id="org43c0dc6"><span class="section-number-2">22.</span> Reduction with multiple arguments 2</h2>
<div class="outline-text-2" id="text-22">
<ol class="org-ol">
<li>\((\lambda xy . xy)\,(\lambda z. a)\,1\)</li>
<li>\((\lambda x . (\lambda y. xy))\,(\lambda z . a)\,1\)</li>
<li>\([x := (\lambda z . a)]\)</li>
<li>\((\lambda y.(\lambda z. a)\,y)\, 1\)</li>
<li>\([y := 1]\)</li>
<li>\((\lambda z . a)\,1\)</li>
<li>\([z := 1]\)</li>
<li>\(a\)</li>
</ol>
</div>
</div>

<div id="outline-container-org938c533" class="outline-2">
<h2 id="org938c533"><span class="section-number-2">23.</span> Proof-theory</h2>
<div class="outline-text-2" id="text-23">
<ul class="org-ul">
<li>Simplification rules for the lambda calculus:
<ul class="org-ul">
<li>\(\beta \)-reduction</li>
<li>\(\alpha \)-conversion</li>
<li>\(\eta\)-reduction</li>
</ul></li>

<li>The lambda calculus can be thought of as a <i>logic</i>, and these rules constitute its proof theory.</li>
<li>We've left the (denotational) semantics of the lambda calculus implicit, but intuitively \(\beta \)-reduction is licit <i>because</i> applications are interpreted by applying the function to the argument, etc.</li>
<li>The variant of the lambda calculus we're considering here is <i>Turing complete</i>, which means that it can be used to simulate an arbitrary Turing machine.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd3a12f8" class="outline-2">
<h2 id="orgd3a12f8"><span class="section-number-2">24.</span> More alpha conversions</h2>
<div class="outline-text-2" id="text-24">
<ul class="org-ul">
<li>How do we go about reducing this expression?
<ul class="org-ul">
<li>\((\lambda xy . x x y)\,(\lambda x . xy)\,(\lambda x . xz)\)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge582a0a" class="outline-2">
<h2 id="orge582a0a"><span class="section-number-2">25.</span> Evaluation and simplification</h2>
<div class="outline-text-2" id="text-25">
<ul class="org-ul">
<li>Remember, when we can no longer simplify an expression, the result is said to be in <b>normal form</b> (N.b., there are different kinds of normal forms, but the differences aren't relevant to us).</li>
<li>In programming terms, this corresponds to a <b>fully executed program</b>.</li>
<li>Artithmetic expressions can be thought of as a simple logic/programming language.
<ul class="org-ul">
<li>\((10 + 2) * 100 / 2\)</li>
</ul></li>
<li>What's the normal form of this arithmetic expression?</li>
<li>Remember that complex expressions can nevertheless be in normal form, such as \(\lambda x . x\).</li>
</ul>
</div>
</div>
